
## Plan Result

[CI link](https://github.com/scarowar/test-terraform-branch-deploy/actions/runs/21099044976)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.test


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = <<-EOT
            Environment: dev
            Message: hello world with spaces
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./output.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + environment = "dev"
  + file_path   = "./output.txt"
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"deploy","PRNumber":118,"Program":"tfcmt","SHA1":"b8d752120b22f7633bd5d9cc8f8ae378d3a0b7b7","Vars":{},"WorkflowName":"Terraform Deploy"} -->